Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: When this protocol starts, it receives the session identifier from the lower-level protocol (this is the exchange hash H from the first key exchange).
ja: このプロトコルが開始すると, プロトコルは下層のプロトコルからセッション識別子(最初の鍵交換の再の交換ハッシュ H)を受け取る.

source: Use with SNMPv1/v2c Messages
ja: SNMPv1/v2c メッセージの利用

source: "port-forward" specifies that no "direct-tcpip" requests should be accepted, except those to hosts specified in the comma-separated list supplied as a value to this attribute.
ja: "port-forward" は, この属性の値として与えられたカンマ区切りリストで指定されたホストへのものを除いて, "direct-tcpip" 要求が受けいれられないことを指定する.

source: That is, response[n] MUST be the answer to prompt[n].
ja: つまり, response[n] は, prompt[n] の応答でなければならない.

source: Currently, only the following type is defined.
ja: 現在, 次の種類だけが定義されている.

source: Notes about the PRIVATE USE Range
ja: プライベートな利用(PRIVATE USE) の範囲についての注意

source: Authentication Protocol ...................................21 9.4.1.
ja: 認証プロトコル ...................................21 9.4.1.

source: This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].
ja: このメモは, STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579], STD 58, RFC 2580 [RFC2580] に記述されている SMIv2 に従って MIB モジュールを指定する.

source: The members of this Working Group believe that 'ease of use' is critical to end-user acceptance of security solutions, and no improvement in security is gained if the new solutions are not used.
ja: このワーキンググループのメンバーは, '使い易さ'がセキュリティの解決策をエンドユーザに受け入れてもらうのに重要だと考えている. 新しい解決策が利用されないならば, セキュリティ上の改善は得られない.

source: Interactive Sessions
ja: インタラクティブなセッション

source: Returning the status is RECOMMENDED.
ja: ステータスを返すことは推奨されている.

source: Reserved Messages ........................................27 12.
ja: 予約されたメッセージ................................27 12.

source: Either SNMP entity may act as client or as server, as discussed further below.
ja: SNMP エンティティが, 以下で議論するように, クライアントないしサーバの役割を果すことがある.

source: The key exchange methods described in Section 2 are examples of such methods.
ja: 2 節で記述した鍵交換法が, このような方法の例だ.

source: Generate exchange hash.
ja: 交換ハッシュの生成

source: The value in tmStateReference MUST uniquely identify the session over which the message was received.
ja: tmStateReference 中のこの値は, メッセージを受信するセッションを一意に識別できなければならない.

source: Information on the REQUIRED and RECOMMENDED sets of elliptic curve domain parameters for use with this algorithm can be found in Section 10 of [RFC5656].
ja: このアルゴリズムと共に用いる楕円曲線ドメインパラメータの要求されている集合と推奨される集合の情報は, [RFC5656] の 10節にある.

source: This includes but is not limited to padding, byte order, and data formats.
ja: これは, パディング, バイトオーダー, データフォーマットを含んでいる. それ以外のものも含まれる.

source: The main purpose of sending this request is to get the list of supported methods from the server.
ja: この要求を送る主要な目的は, サーバからサポートしている認証法のリストを得ることだ.

source: Private Use Headers .................................4 3.4.
ja: 私的利用のヘッダ .................................4 3.4.

source: This process is repeated until enough key material is available; the key is taken from the beginning of this value.
ja: このプロセスは, 鍵の素材が十分な長さになるまで繰替えされる; そして鍵はこの素材の最初から取得される.

source: Signing and verifying using the x509v3-rsa2048-sha256 key format is performed according to the RSASSA-PKCS1-v1_5 scheme in [RFC3447] using the SHA-256 hash [FIPS-180-3]; RSA keys conveyed using this format MUST have a modulus of at least 2048 bits.
ja: x509v3-ssh-rsa2048-sha256 鍵フォーマットでの署名と検証は, SHA-256 ハッシュ [FIPS-180-3] を用いる RSASSA-PKCS1-v1_5 scheme in [RFC3447] に従って行なわれる; この形式で運ばれる RSA 鍵は, 少なくとも 2048 ビットのモジュラスを持たなければならない.

source: It is up to the server how to interpret the password and validate it against the password database.
ja: パスワードをどう解釈しどうパスワードのデータベースに対して検証するかは, サーバに委ねられている.

source: The new stateful-decryption counter mode encryption methods described in Section 4 of this document were designed to be secure replacements to the original encryption methods described in [RFC4253].
ja: この文書の4節で記述した新しいステートフル-復号 カウンターモード暗号法は, [RFC4253]で記述された元々の暗号法の安全な代替法として設計された.

source: TCP(seq=x, len=1000) ----> contains Records 1,2
ja: TCP(seq=x, len=1000) ----> Records 1,2 を含む

source: It is usable even when it is not a primitive root, as it still covers half of the space of possible residues.
ja: これは, 原始根でない場合も有効だ. 可能な剰余の空間の半分をカバーするからだ.

source: In Suite B, one of the following key agreement methods MUST be used to generate a shared secret value (SSV):
ja: Suite B では, 次の鍵交換法のうち1つが, 共有秘密値 (SSV) を生成するのに用いられなければならない.

source: This document describes a subsystem that can be used to configure public keys in an implementation-independent fashion.
ja: この文書は, 実装に依存しない形で公開鍵を設定するためのサブシステムを記述する.

source: [RFC3279] and [RFC5280] describe the structure of X.509v3 certificates to be used with RSA and Digital Signature Algorithm (DSA) public keys.
ja: [RFC3279] と [RFC5280] は, RSA と デジタル署名アルゴリズム (DSA) 公開鍵で利用する X.509v3 証明書の構造を記述している.

source: The value for 'rsa_signature_blob' is encoded as a string containing s (which is an integer, without lengths or padding, unsigned, and in network byte order).
ja: 'rsa_signature_blob' の値は,(長さやパディングがない符号無しのネットワークバイトオーダーの160-bitの整数である) s を含む文字列としてエンコードされる.

source: The presence and use of this header data SHOULD be reviewed by sites that deploy this file format.
ja: このヘッダフィールドの有無と利用は, このファイル形式を配置するサイトによって精査される必要がある.

source: If the user chooses to continue the session with the stored public key of the server (not the public key offered at the start of the session), then the session-specific data between the attacker and server will be different between the client-to-attacker session and the attacker- to-server sessions due to the randomness discussed above.
ja: ユーザが, (セッションの開始時に提供された公開鍵ではなく) 保持していたサーバ公開鍵を用いてセッションを継続することを選択すると, 攻撃者とサーバの間のセッション固有のデータは,クライアントと攻撃者のセッションや(前述したランダム性のために)その他の攻撃者とサーバの間のセッションと異なる.

source: Public Key Algorithms
ja: 公開鍵アルゴリズム

source: The operations to add, remove, and list the authenticated user's public keys are performed as request packets sent to the server.
ja: 認証されたユーザの公開鍵の追加や削除, 一覧の取得の操作は, サーバに送られる要求パケットで実行される.

source: Verify server's signature.
ja: サーバの署名の検証

source: languages This is a name-list of language tags in order of preference [RFC3066].
ja: languages 優先度順の言語タグ名前リストだ [RFC3066].

source: It MUST be FALSE if the request was not successfully processed.
ja: 要求が失敗した場合は, FALSE でなければならない.

source: MAC Algorithm Names ...............................17 4.11.3.
ja: MACアルゴリズム名 ...............................17 4.11.3.

source: No other confidentiality or data integrity algorithms are permitted.
ja: 他の機密性やデータ完全性アルゴリズムは許可されない.

source: Replay detection using monotonically increasing sequence numbers as input to the MAC, or HMAC in some cases, is described in [RFC2085], [RFC2246], [RFC2743], [RFC1964], [RFC2025], and [RFC4120].
ja: MACや場合によってはHMACへの入力に単調に増加するシーケンス番号を用いるリプレイ検知は以下に記述されている. [RFC2085], [RFC2246], [RFC2743], [RFC1964], [RFC2025], [RFC4120].

source: 74 ONOCR Translate newline to carriage return-newline (output).
ja: 74 ONOCR 出力で, NLをCR-NLに置き換える.

source: The program can be a shell, an application program, or a subsystem with a host-independent name.
ja: このプログラムは, シェルでも, アプリケーションでも, ホストに依存しない名前を持つサブシステムでもよい.

source: If this step is skipped, then authentication of the SSH server to the SSH client is not done.
ja: このステップがスキップされると, SSHサーバのSSHクライアントへの認証が行なわれない.

source: ECMQV Key Exchange
ja: ECMQV 鍵交換

source: "Authentication" in this document typically refers to the English meaning of "serving to prove the authenticity of" the message, not data source authentication or peer identity authentication.
ja: この文書での "認証"は, データソースの認証やピアの識別情報の認証ではなく, メッセージの '正真性の証明を提供" という英語の意味を典型的に差す.

source: Implementations MAY use the first 15 bytes of the version packet as a "magic cookie" to avoid processing spurious output from the user's shell (as described in Section 6.5 of [4]).
ja: 実装は, ([4] の6.5 節で記述しているように) ユーザのシェルからの誤った出力を処理するのを避けるために, バージョンパケットの最初の15バイトに "magic cookie" を利用してもよい.

source: Additional thoughts about authentication timeouts and retries may be found in [ssh-1.2.30].
ja: 認証のタイムアウトと再試行についてのさらなる考察が [ssh-1.2.30] にある..

source: Capabilities Exchange .
ja: 機能の交換 .

source: Specific concessions were made to make widespread, fast deployment easier.
ja: 広くすばやい配置を容易にするため, 仕様における妥協がおこなわれている.

source: Each identifier is the concatenation of the string "ecdsa-sha2-" with the elliptic curve domain parameter identifier as defined in Section 6.1.
ja: それぞれの識別子は, 文字列 "ecdsa-sha2-" と 6.1節で定義した楕円曲線ドメインパラメータ識別子の連結だ.

source: Other terminology and symbols have the same meaning as in [RFC4253].
ja: 他の用語とシンボルは, [RFC4253]のものと同じ意味を持つ.

source: The credentials used to authenticate the SSH principal are determined in an implementation-dependent manner.
ja: SSH プリンシパルを認証するのに用いられる資格情報は, 実装依存の方法で決定される.

source: Traffic Analysis
ja: トラフィック解析

source: If we make the reasonable assumption that the underlying components (such as AES and HMAC-SHA1) are secure, then the attacker against the symmetric portion of the SSH protocol cannot be very successful (since otherwise there would be a contradiction).
ja: 基底の部分(AESやHMAC-SHA1のような)が安全だという合理的な仮定ができる場合, SSHプロトコルの対称部分への攻撃はほぼ成功しないだろう(さもなければ矛盾となる).

source: An attacker may use social engineering techniques to pass off server keys to unsuspecting users and may then place a man-in-the-middle attack device between the legitimate server and the clients.
ja: 攻撃者は, 疑いを持たないユーザに対してサーバの鍵の偽物をつかませるソーシャルエンジニアリングの技術を使い, そして正当なサーバとクライアントの間に中間者攻撃用のデバイスを配置するかもしれない.

source: Protocol Version Exchange ..................................4 5.
ja: プロトコルバージョンのやりとり.................................4 5.

source: The "none" cipher is provided for debugging and SHOULD NOT be used except for that purpose.
ja: "none" 暗号は, デバッグのために提供されている. これ以外の目的に利用しないほうがよい.

source: People deploying SSH are reminded of the consequences of man-in-the-middle attacks if the client does not have a very strong a priori association of the server with the host key of that server.
ja: SSHを配置する際には, クライアントがサーバとそのホスト鍵が事前に強く結びついていない場合に起きる中間者攻撃の結果を把握すること.

source: Since the replayed packet will not be using that expected sequence number (the sequence number of the replayed packet will have already been passed by the receiver), the calculated MAC will not match the MAC received with the packet.
ja: リプレイされたパケットは, 期待されるシーケンス番号を利用していないので(リプレイされたパケットのシーケンス番号はすでに受け取り手に渡されている), 計算されたMACはパケットに含まれるMACと一致しない.

source: This document defines one method: Fingerprint storage in DNS.
ja: この文書は1つの方法を定義している: DNSの指紋ストレージ.

source: GCM Authenticated Decryption
ja: AES GCM の認証付き復号

source: Note that after a key exchange with implicit server authentication, the client MUST wait for a response to its service request message before sending any further data.
ja: 暗黙のサーバ認証での鍵交換の後では, クラアイントは, 他のデータを送る前にサービスの要求メッセージに対する返答を待たなければならないことに注意すること.

source: This document describes version 2 of the protocol.
ja: この文書はプロトコルバージョン 2 を記述している.

source: The signature field Sig_U is an ECDSA signature of the concatenation of several values, including the session identifier, user name, service name, public key algorithm name, and the user's public signing key.
ja: 署名のフィールド Sig_U は, セッション識別子やユーザ名, サービス名, 公開鍵アルゴリズム名, ユーザの公開署名鍵を含むいくつかの値の連結の ECDSA 署名だ.

source: This document is concerned with SSH implementation details; specification of the underlying cryptographic algorithms and the handling and structure of X.509v3 certificates is left to other
ja: この文書はSSH実装の詳細に関連している; 基底の暗号アルゴリズムの仕様や X.509v3 証明書の操作や構造は他の標準文書に委ねられている. 特に [RFC3447], [FIPS-186-3],[FIPS-180-2], [FIPS-180-3], [SEC1], [RFC5280] だ.

source: Host-Based Authentication: "hostbased"
ja: ホストベース認証: "hostbased"

source: For example, the names in a name-list may have to be a list of valid algorithm identifiers (see Section 6 below), or a list of [RFC3066] language tags.
ja: 例えば, name-list中の name は, 正当なアルゴリズム識別子(セクション6以下参照)でなければならないかもしれないし , [RFC3066] 言語タグでなければならないかもしれない.

source: All elliptic curve public keys MUST be validated after they are received.
ja: すべての楕円曲線公開鍵は, 受信後に検証されなければならない.

source: When the window (terminal) size changes on the client side, it MAY send a message to the other side to inform it of the new dimensions.
ja: ウィンドウ (ターミナル) サイズがクライアント側で変更する場合, 新しい容量を相手側に知らせるために次のメッセージを送ってもよい.

source: Initial Assignments .................................7 4.2.3.
ja: 初期の割り当て..................................7 4.2.3.

source: Signing and verifying using the x509v3-ssh-rsa key format is performed according to the RSASSA-PKCS1-v1_5 scheme in [RFC3447] using the SHA-1 hash [FIPS-180-2].
ja: x509v3-ssh-rsa 鍵フォーマットでの署名と検証は, SHA-1 ハッシュを用いる RSASSA-PKCS1-v1_5 scheme in [RFC3447] に従って行なわれる.

source: The protocol can support other systems as well, but the client may need to fill reasonable values for a number of parameters so the server pty gets set to a reasonable mode (the server leaves all unspecified mode bits in their default values, and only some combinations make sense).
ja: このプロトコルは, 他のシステムも同様にサポートできる. ただし, サーバのptyが適切なモードを設定できるように, クライアントはいくつかのパラメータを適切に設定する必要があるだろう ( サーバはすべての指定されていないモードのビットをデフォルト値のまま残すので, いくつかの組合せだけが意味を成す)

source: Threats .............................................8 3.1.2.
ja: 脅威 .............................................8 3.1.2.

source: Then the Transport Model passes the message to the Dispatcher using the following ASI:
ja: そして, トランスポートモデルは, 次のASI を用いて Dispatcher にメッセージを渡す.

source: A provision is made here for locally extensible names.
ja: ローカルに拡張可能な名前についての準備が以下のようにされている.

source: Implementations SHOULD NOT normally allow such connections by default, as they pose a potential security problem.
ja: 実装は通常このような接続をデフォルトでは許容しないほうがよい. 潜在的なセキュリティの問題をもたらすからだ.

source: AES GCM Authenticated Decryption ...........................3 5.
ja: AES GCM の認証付き復号 ...........................3 5.

source: It runs over the transport after successfully authenticating the principal.
ja: このプロトコルはトランスポート層プロトコル上で動作する.

source: As with all SSH authentication methods, successful completion is indicated by an SSH_MSG_USERAUTH_SUCCESS if no other authentication is required, or an SSH_MSG_USERAUTH_FAILURE with the partial success flag set if the server requires further authentication.
ja: すべてのSSH認証法と同様に, 他の認証が必要ない場合は, 成功は SSH_MSG_USERAUTH_SUCCESS で示される. 成功したが, サーバがさらなる認証を必要とする場合は, partial success フラグが設定され たSSH_MSG_USERAUTH_FAILURE で示される.

source: Otherwise, the guess is considered to be right, and the optimistically sent packet MUST be handled as the first key exchange packet.
ja: さもなければ, 推測が正しいと考え, 楽観的に送られたパケットは最初の鍵交換パケットとして扱われなければならない.

source: Galois Counter Mode (GCM) is a block-cipher mode of operation that provides both confidentiality and data-integrity services.
ja: Galois カウンタモード (GCM) は, 機密性とデータ完全性サービスの両方を提供する操作のブロック暗号モードだ.

source: The following describes the procedure to follow to close a session between a client and server.
ja: 以下で, クライアントとサーバの間のセッションを終了する手続を記述する.

source: At the discretion of the implementers, this default policy may be along the lines of anything-goes where there are no restrictions placed upon users, or it may be along the lines of excessively-restrictive, in
ja: 実装者の裁量で, このデフォルトのポリシーはユーザに何ら制限がない何でもありのものかもしれないし過剰なまでに制限されているかもしれない.

source: Neither side should establish a NETCONF over SSH connection with an unknown, unexpected, or incorrect identity on the opposite side.
ja: クライアントもサーバも, 未知の, もしくは, 予期しない, 不正解な相手側の識別情報による SSH 接続上の NETCONF を確立してはならない.

source: These definitions allow any GSS-API mechanism to be used with the Secure Shell protocol.
ja: これらの定義によって, セキュアシェルプロトコルと共に任意のGSS-APIメカニズムを利用できる.

source: Instead, the server SHOULD select the language to be used based on the tags communicated during key exchange [SSH-TRANS].
ja: 代わりに, サーバは鍵交換時に通信されるタグに基づいて言語を選択する必要がある [SSH-TRANS].

source: Relationship to Other MIB Modules
ja: 他のMIB モジュールとの関係

source: Implementations MUST correctly handle window sizes of up to 2^32 - 1 bytes.
ja: 実装は, 2^32 -1 byteまでのwindow size を正しく扱えなければならない.

source: Client implementations SHOULD reject any session channel open requests to make it more difficult for a corrupt server to attack the client.
ja: クライアントの実装は, どんなセッションチャンネルの開始要求も拒否する必要がある. 邪悪なサーバがクライアントを攻撃するのをより難しくするためだ.

source: Copyright (C) The Internet Society (2006).
ja: Copyright (C) The Internet Society (2006). 訳者: 春山 征吾 <haruyama@unixuser.org>.

source: First, the client sends:
ja: まず, クライアントは以下を送る:

source: RFC 4742 assumes that the end-of-message (EOM) sequence, ]]>]]>, cannot appear in any well-formed XML document, which turned out to be mistaken.
ja: RFC 4742 は, メッセージ終了 (EOM) 文字列, ]]>]]>, が整形された XML 文書に出てこないことを仮定していたが, これは間違いだった.

source: Control Character Filtering ...............................14 9.3.
ja: 制御文字のフィルタリング ...............................14 9.3.

source: Opcodes 160 to 255 are not yet defined, and cause parsing to stop (they should only be used after any other data).
ja: Opcode の 160 から 255 までは, まだ定義されていない. これを受けとった側はパースを停止する(これらは他のデータの後でのみ利用される必要がある).

source: A description of these curves can be found in [NIST] or [SEC2].
ja: これらの曲線の説明は, [NIST] や [SEC2] にある.

source: Encryption
ja: 暗号化

source: After the SSH_MSG_KEXINIT message exchange, the key exchange algorithm is run.
ja: SSH_MSG_KEXINIT メッセージが交換されたら, 鍵交換アルゴリズムが動作する.

source: A local service should use the PRIVATE USE syntax of "servicename@domain".
ja: ローカルなサービス名は, "servicename@domain" という PRIVATE USE な構文を使わなければならない.

source: Ylonen & Lonvick Standards Track [Page 13] RFC 4253 SSH Transport Layer Protocol January 2006
ja: lonen & Lonvick Standards Track [Page 13] RFC 4253 SSH Transport Layer Protocol January 2006

source: When either side wishes to open a new channel, it allocates a local number for the channel.
ja: 一方の側がチャンネルを開始したい時, チャンネルに対してローカルな番号を割り当てる.

source: Maximum Packet Length ......................................8 6.2.
ja: 最大パケット長 ......................................8 6.2.

source: The remote side then decides whether it can open the channel, and responds with either SSH_MSG_CHANNEL_OPEN_CONFIRMATION or SSH_MSG_CHANNEL_OPEN_FAILURE.
ja: リモート側はチャンネルを開始するかどうかを決定する. そして SSH_MSG_CHANNEL_OPEN_CONFIRMATION か SSH_MSG_CHANNEL_OPEN_FAILURE で返答する.

source: It is RECOMMENDED that SSH ECC implementations also support the following curves.
ja: SSH楕円曲線暗号実装は次の曲線もサポートすることが推奨される.

source: The 'sender channel' is a local identifier for the channel used by the sender of this message.
ja: 'sender channel' は, このメッセージの送り手が使うチャンネルのローカルな識別子だ.

source: The client initiates the connection.
ja: クライアントが, 接続を開始する.

source: If the MIC is valid and the server is satisfied as to the user's credentials, it MAY return either SSH_MSG_USERAUTH_SUCCESS or SSH_MSG_USERAUTH_FAILURE with the partial success flag set, depending on whether additional authentications are needed.
ja: MIC が正当でサーバがユーザの認証情報に満足したら, 追加の認証が必要ない場合はSSH_MSG_USERAUTH_SUCCESS を返す. 追加の認証が必要な場合は, partial success フラグを設定した SSH_MSG_USERAUTH_FAILURE を返す.

source: In order to establish a GSS-API security context, the SSH client needs to determine the appropriate targ_name to use in identifying the server when calling GSS_Init_sec_context().
ja: GSS-API セキュリティコンテキストを確立するために, GSS_Init_sec_context() を呼ぶ際にサーバの識別に用いる適切な targ_name を クライアントは決定する必要がある.

source: channel type specific data follows
ja: channel type が後に続くデータを指定する.

source: A status message MUST be sent for any unrecognized packets, and the request SHOULD NOT close the subsystem.
ja: 状態メッセージは, どのような認識されないパケットに対しても送られなければならない. 対応する要求はサブシステムを終了しないほうがよい.

source: If the client does truncate any fields, there MUST be an obvious indication that such truncation has occurred.
ja: クライアントがフィールドを切り詰めるなら, 切り詰めが起ったことを明確に表示しなければならない.

source: The public key algorithm for signing is negotiated with the KEXINIT messages.
ja: 署名に用いる公開鍵アルゴリズムは, KEXINIT メッセージで取り決める.

source: o p is a large safe prime, g is a generator for a subgroup of GF(p), and q is the order of the subgroup
ja: o p は安全な大きな素数で, gは GF(p)の部分群の生成器, qは部分群のオーダだ.

source: Initiating GSS-API Authentication .........................13 3.3.
ja: GSS-API 認証の開始 .........................13 3.3.

source: Specifically, the message follows the ABNF [RFC5234] rule Chunked- Message:
ja: 具体的には, メッセージは ABNF [RFC5234] の rule Chunked-Message に従う:

source: Developers should be aware of the sensitive nature of some of the normal event and debug messages, and may want to provide guidance to administrators on ways to keep this information away from unauthorized people.
ja: 開発者は, 通常のイベントメッセージやデバッグメッセージのいくつかが重要な性質を持つことに注意しなければならない. そして, 不当な人間がこれらの情報に近づけないために管理者に手引きを提供しようとしてもよい.

source: The Status Message
ja: 状態メッセージ

source: The latter is preferable.
ja: 後者のほうが好ましい.

source: The length field describes the length of the name field and of the request/response-specific data, but does not include the length of the length field itself.
ja: length フィールドは name フィールドと request/response-specific data の長さを表す. length フィールド自体の長さは含まない.

source: A Transport Model SHOULD NOT require changes to the underlying security protocol.
ja: トランスポートモデルは基底のセキュリティプロトコルに変更を求めないほうがよい.

source: An authentication request MAY result in a further exchange of messages.
ja: 認証の要求は, さらにメッセージの交換を行なってもよい.

source: The 'recipient channel' is the channel number given in the original open request, and 'sender channel' is the channel number allocated by the other side.
ja: 'recipient channel' は, 元の開始要求で与えられたチャンネル番号だ. 'sender channel' は相手側で割り当てられたチャンネル番号だ.

source: the packet description in [RFC4253] and (2) not leak precise information about the length of the packet's payload data.
ja: 理由は(1) [RFC4253]のパケットの記述を変更しないため, (2) パケットのペイロードデータの長さの正確な情報を漏らさないため, だ.

source: Additionally, the User Authentication Protocol described in [RFC4252] allows for the use of a digital signature to authenticate the client to the server ("publickey" authentication).
ja: また, [RFC4252] に記述されているユーザ認証プロトコルでは, サーバにクライアントを認証するために電子署名を利用できる ("publickey" 認証).

source: This allows an operator or management station to ensure the authenticity of the SNMP engine that provides MIB data.
ja: これにより, MIB データを提供する SNMP エンジンの信頼性を運用者や管理ステーションが確保できる.

source: Figure 2: Structure of a Secure Shell Binary Packet
ja: 図 2: セキュアシェルのバイナリパケットの構造

source: Most signature algorithms include hashing and additional padding.
ja: 殆どの署名のアルゴリズムは, ハッシュと追加のパディングを含んでいる

source: Note that if L is less than or equal to 128, then the recommendation in this subsection supersedes the recommendation in Section 3.1.
ja: 注意: L が128以下の場合, この節の推奨は 3.1節の推奨よりを上書きする.

source: The client MAY specify more than one comment if it additionally specifies a different language for each of those comments.
ja: クライアントは, それぞれのコメントに異なる言語を指定するなら, 1つ以上のコメントを指定してよい.

source: Upon receipt of a certificate chain, implementations MUST verify the certificate chain according to Section 6.1 of [RFC5280] based on a root of trust configured by the system administrator or user.
ja: 証明書チェーンを受け取ったら, システム管理者やユーザに設定された 信頼のルートに基いて [RFC5280] の 6.1 節に従い証明書チェーンを実装は検証しなければならない.

source: Special care should be taken when designing debug messages.
ja: デバッグメッセージの設計には特別な注意が必要だ.

source: The server and client continue to trade these two messages as long as the server's calls to GSS_Accept_sec_context() result in major_status codes of GSS_S_CONTINUE_NEEDED.
ja: GSS_Accept_sec_context() のサーバでの呼び出しで major_status コード が GSS_S_CONTINUE_NEEDED となっている限り, サーバとクライアントはこの2つのメッセージをやりとりし続ける.

source: Formation of the Binary Packet
ja: バイナリパケットの形成

source: If the algorithm and fingerprint of the key received from the SSH server match the algorithm and fingerprint of one of the SSHFP resource record(s) returned from DNS, the client MAY accept the identity of the server.
ja: SSH サーバから取得した鍵のアルゴリズムと指紋が, DNSから返されたSSHFP リソースレコードの1つの鍵のアルゴリズムと指紋と一致したら, クライアントはサーバの同一性を受け入れてもよい.

source: It is intended to be run over the SSH transport layer protocol [SSH-TRANS].
ja: SSH トランスポート層プロトコル [SSH-TRANS] の上で動作することを想定している.
